{
    "categories": [
      {
        "title": "WATCH",
        "image": "https://m.media-amazon.com/images/I/6152wS4BKxL.jpg",
        "id": "ce39"
      },
      {
        "title": "CAR TOY",
        "image": "https://olcha.uz/image/700x700/products/supplier/stores/1/2023-09-22/QWvuMSChOrtlYZK4z7e7ThPt9dn8v3ZIoZhvMBw6TMLeQWl2rGfbqQAhGCH3.jpg",
        "id": "4424"
      },
      {
        "title": "Laptops",
        "image": "https://hiraoka.com.pe/media/mageplaza/blog/post/m/a/macbook_air_vs._macbook_pro-_cuales_son_sus_diferencias.jpg",
        "id": "362c"
      },
      {
        "title": "Iphones",
        "image": "https://m.media-amazon.com/images/I/61VfL-aiToL.jpg",
        "id": "165c"
      }
    ],
    "products": [
      {
        "title": "iPhone 14 Pro Max",
        "image": "https://www-konga-com-res.cloudinary.com/w_400,f_auto,fl_lossy,dpr_3.0,q_auto/media/catalog/product/S/E/67343_1663482037.jpg",
        "price": "1600",
        "description": "iPhone 14 Pro Max — zanglamaydigan po'latdan va Ceramic Shield zarbaga qarshi oynadan yasalgan oltinrangli korpusli smartfon, 256 Gb ichki xotiraga ega. IP68 suv va changdan himoya qilish klassi tufayli qurilma 6 m chuqurlikka botganda zarar ko'rmaydi. 6,7 dyumli super Retina xdr Pro Motion tipidagi ekran OLED texnologiyasidan foydalangan holda ishlab chiqarilgan.",
        "id": "1"
      },
      {
        "id": "2",
        "title": "Samsung Galaxy S23 Ultra",
        "price": 1100,
        "image": "https://m.media-amazon.com/images/I/61VfL-aiToL.jpg",
        "description": "Galaxy S23 Ultra - Sayyoramizni hisobga olgan holda ishlab chiqarilgan va o'rnatilgan s Pen, Nightography kamerasi va qiziqarli o'yinlar uchun kuchli chip bilan jihozlangan. Professional darajadagi kadrlarning xotiraga muxrlash uchun Expert RAW dasturidan foydalanishingiz mumkin. Astrofoto, ko'pgina ekspozitsiya va boshqa xususiyatlarga ega 50 MP kamera bilan ajoyib suratlar olish imkoniga egasiz. Rasmlaringiz va videolaringiz kuning istalgan vaqtida yani quyosh botishidan tonggacha olingan kadrlarni aniq va tiniq olish imkoniyatiga egasiz.",
        "categoryId": null
      },
      {
        "id": "3",
        "title": "Honor X8b 8/128GB",
        "price": 320,
        "image": "https://assets.asaxiy.uz/product/items/desktop/d787b85d4d827ced1d6f25fdf7ef669a2024010813542627538pG40cD8DCy.png",
        "description": "Honor X8b smartfoni 90 Gts yangilanish tezligi, 2000 cd/m2 eng yuqori yorqinligi va 3240 chastotali PWM orqa nuri nazorati bilan FHD+ (2412 × 1080 piksel) o‘lchamli 6,7 dyuymli AMOLED displey bilan jihozlangan. Ekran qo‘llab-quvvatlaydi. 16,7 million rang soyasi va DCI-P3 rang maydonining 100 foizini qamrab oladi. Ekranning yuqori qismida oval shaklidagi Magic Capsule kesmasi mavjud, yangi funktsional displey elementida suhbat vaqti, taymer, ovoz yozish moslamasi aks etadi.",
        "categoryId": null
      },
      {
        "id": "4",
        "title": "Xiaomi Redmi Note 13 Pro",
        "price": 380,
        "image": "https://assets.asaxiy.uz/product/items/desktop/a86c450b76fb8c371afead6410d5553420240117145846554823R9HQkGben.png",
        "description": "Xiaomi bugun nafaqat Redmi Note 13, Redmi Note 13 Pro va Redmi Note 13 Pro+ modellarini, balki yanada arzonroq Redmi Note 13 Pro 4G va Redmi Note 13 4G modellarini ham global bozorga chiqardi.",
        "categoryId": null
      },
      {
        "title": "Apple MacBook Pro 13 M2",
        "image": "https://hiraoka.com.pe/media/mageplaza/blog/post/m/a/macbook_air_vs._macbook_pro-_cuales_son_sus_diferencias.jpg",
        "price": "1600",
        "description": "Applening MacBook Air noutbuklari har doim o'zining eng yuqori sifati bilan mashhur bo'lgan, ammo bu yerda katta o'zgarishlar kamdan-kam uchrashi mumkin. Biroq, Apple M1 protsessorining chiqarilishi bilan hamma narsa o'zgacha tus oldi. Shunday qilib, Applening yangi MacBook Air M1 (2020) ultrabukining kuchi keyingi bosqichga ko'tarildi.",
        "id": "5"
      },
      {
        "title": "HP 250 G9. Core I3-1215U",
        "image": "https://www.notebookcheck.net/fileadmin/_processed_/8/9/csm_IMG_1382_aeb753831c.jpg",
        "price": "465",
        "description": "HP 250 G9 Affordable Business Notebook 15,6 dyuymli katta displeyga ega nozik va engil dizaynda kerakli quvvat va unumdorlikni taqdim etadi. Chiroyli va engil, HP 250 noutbuki yupqa va engil dizayni hamda katta ekranning tanaga nisbati bilan mobil ish uslubiga mos keladi. Ish uchun ishlab chiqilgan, oynashga tayyor. Kuchli Intel protsessor, tezkor xotira va saqlash bilan ishlarni bajaring",
        "id": "7"
      },
      {
        "id": "8",
        "title": "Jeyms Klir: Atom odatlar",
        "price": 5.3,
        "image": "https://assets.asaxiy.uz/product/items/desktop/6097870216ddfc90f71880b1082c42912023080116353962082BFoT6DM8hD.jpg.webp",
        "description": "New York Timesning birinchi raqamli bestselleri. Dunyo bo'ylab 2 yilda 5 milliondan ortiq nusxada sotilgan! Ushbu kitob sizga har kuni oz-ozdan yaxshilanib borishning sinalgan dasturini taklif qiladi. Odatlarni shakllantirish boyicha dunyoning yetakchi ekspertlaridan bori Jeyms Klir yaxshi odatlarni shakllantirish, yomonlaridan xalos bolish hamda katta natijalarga olib boruvchi kichik odatlarni egallashni orgatuvchi amaliy strategiyalarni ochib beradi.",
        "categoryId": null
      },
      {
        "title": "Kel Nyuport: Diqqat",
        "image": "https://assets.asaxiy.uz/product/items/desktop/fa90db78a40bb28c08346e05813bbdc32023081211154164899UjRcxiQ24T.jpg",
        "price": "6.1",
        "description": "Kitobda eng muhim mavzu, keraksiz kichik narsalarga chalgʻimasdan, diqqatni murakkab va muhim vazifalarga jalb qilish haqida yozilgan. Kitobda taʼkidlanishicha zamonaviy dunyoda diqqatini jamlab, bir vazifa ustida ishlay bilgan odamlargina haqiqiy yutuqlarga erisholadi.",
        "id": "9"
      },
      {
        "title": "Leonid Chigrin: Yapon zobiti",
        "image": "https://assets.asaxiy.uz/product/items/desktop/3240457561e8153779adc521e1e7ff6c20230504161141745118rtzw5LJgs.jpg.webp",
        "price": "4",
        "description": "Yapon zobiti rus-yapon urushiga oʻziga xos nuqtai nazarni taqdim etadigan yaxshi yozilgan va qiziqarli roman. Yaponiya tarixi, Koreya tarixi yoki harbiy fantastika bilan qiziqqan, badiiy kitoblarni sevadigan, syujeti sabab oʻziga bogʻlab qoʻyadigan kitobni oʻqishni istagan kitobxonlarga tavsiya etiladi.",
        "id": "10"
      },
      {
        "id": "8016",
        "title": "ROLEX DATEJUST 36 MM STEEL",
        "price": "11200",
        "image": "https://privilegia.uz/wp-content/uploads/2023/05/dong-ho-rolex-datejust-36-126200-0024-mat-so-xanh-la-day-deo-oyster-thep-1-1-e1703329177852.jpg",
        "description": "Водостойкие часы Rolex Datejust 36 mm Steel являются официально сертифицированным хронометром COSC выпущены в круглом корпусе из нержавеющей стали. Размер составляет 36 мм, водонепроницаемость 100 м. Внутри корпуса установлен автоматический механизм, Калибр 3235, обеспечивающий запас хода 70 часов. На зеленом циферблате отображаются часы, минуты, секунды дата. Часы комплектуются браслетом из нержавеющей стали.",
        "categoryId": "ce39"
      },
      {
        "title": "CAR TOYS",
        "image": "https://olcha.uz/image/700x700/products/supplier/stores/1/2023-09-22/6F69NBBn1sG0MxhmaKhglL2RAl4wJB4l7tB3yfX4M8sncsGxILuV72Ju7yOJ.jpg",
        "price": "215",
        "description": "Электромобиль для детей от года и старше – это не только средство развлечения, но и развивающая игрушка, еще одним ее преимуществом выступает тот факт, что детям не надоедает кататься в авто, даже в случае непогоды его можно использовать дома или в квартире. Правильно подобранный автомобиль сможет превратиться из обычной игрушки, в полезное времяпрепровождение. Психологи давно утверждают, что дети лучше усваивают нужную информацию в процессе игры.\nРасчертите на дорожке возле дома или в другом удобном месте дорожную разметку, нарисуйте знаки, и Вы увидите, как скучные правила превратятся в самое настоящее приключение. Не стоит упускать из вида и тот факт, что уход за электромобилем должен входить в обязанности малыша, разумеется, если речь не идет о двухлетнем карапузе. Такой подход развивает у ребенка чувство порядка и ответственности.\nДругими словами, детский электромобиль – это:\nинтересное времяпрепровождение;\nспособ легко и быстро выучить с малышом основные правила дорожного движения;\nвозможность привить ребенку такие жизненно важные качества, как ответственность, обязательность, аккуратность;\nигрушка, которая может прослужить на протяжении многих лет при условии правильной ее эксплуатации.",
        "id": "0a1e"
      }
    ]
  }